fio/test_suite_sd_results/bs128k_read60write40.txt
bs128k_read60write40: (g=0): rw=randrw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs128k_read60write40: Laying out IO file (1 file / 100MiB)
bs128k_read60write40: Laying out IO file (1 file / 100MiB)
bs128k_read60write40: Laying out IO file (1 file / 100MiB)
[...]

bs128k_read60write40: (groupid=0, jobs=4): err= 0: pid=3640: Sun Jun  8 22:01:53 2025
  read: IOPS=25, BW=3305KiB/s (3384kB/s)(104MiB/32188msec)
    clat (msec): min=7, max=11997, avg=149.44, stdev=1054.56
     lat (msec): min=7, max=11997, avg=149.45, stdev=1054.56
    clat percentiles (msec):
     |  1.00th=[   20],  5.00th=[   24], 10.00th=[   24], 20.00th=[   25],
     | 30.00th=[   25], 40.00th=[   25], 50.00th=[   25], 60.00th=[   25],
     | 70.00th=[   26], 80.00th=[   26], 90.00th=[   27], 95.00th=[   28],
     | 99.00th=[ 4144], 99.50th=[ 9329], 99.90th=[12013], 99.95th=[12013],
     | 99.99th=[12013]
   bw (  KiB/s): min= 1020, max=21504, per=100.00%, avg=15122.00, stdev=2103.78, samples=56
   iops        : min=    4, max=  168, avg=117.86, stdev=16.56, samples=56
  write: IOPS=17, BW=2298KiB/s (2354kB/s)(72.2MiB/32188msec); 0 zone resets
    clat (usec): min=206, max=1162.0k, avg=4473.86, stdev=67776.61
     lat (usec): min=209, max=1162.0k, avg=4481.82, stdev=67776.86
    clat percentiles (usec):
     |  1.00th=[    210],  5.00th=[    219], 10.00th=[    225],
     | 20.00th=[    262], 30.00th=[    297], 40.00th=[    302],
     | 50.00th=[    310], 60.00th=[    326], 70.00th=[    396],
     | 80.00th=[    474], 90.00th=[    545], 95.00th=[    652],
     | 99.00th=[   1565], 99.50th=[  38536], 99.90th=[1166017],
     | 99.95th=[1166017], 99.99th=[1166017]
   bw (  KiB/s): min= 2048, max=22016, per=100.00%, avg=12904.73, stdev=1447.34, samples=46
   iops        : min=   16, max=  172, avg=100.82, stdev=11.31, samples=46
  lat (usec)   : 250=7.24%, 500=27.68%, 750=4.97%, 1000=0.43%
  lat (msec)   : 2=0.35%, 10=0.07%, 20=0.71%, 50=57.27%, 2000=0.43%
  lat (msec)   : >=2000=0.85%
  cpu          : usr=0.03%, sys=0.42%, ctx=867, majf=0, minf=109
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=831,578,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3305KiB/s (3384kB/s), 3305KiB/s-3305KiB/s (3384kB/s-3384kB/s), io=104MiB (109MB), run=32188-32188msec
  WRITE: bw=2298KiB/s (2354kB/s), 2298KiB/s-2298KiB/s (2354kB/s-2354kB/s), io=72.2MiB (75.8MB), run=32188-32188msec

Disk stats (read/write):
  mmcblk0: ios=828/170, merge=0/6, ticks=83372/1829934, in_queue=1913306, util=96.08%